<?php

return [
    'digits' => 'Полето :attribute трябва да бъде точно :digits цифри.',
    'required' => 'Полето :attribute е задължително.',
    'unique' => ':attribute вече съществува.',
    'email' => ':attribute трябва да бъде валиден имейл адрес.',
    'min' => [
        'string' => ':attribute трябва да бъде поне :min символа.',
    ],
    'sms_code_invalid' => 'SMS кодът за потвърждение е невалиден.',
    'phone_confirmed' => 'Телефонният номер беше успешно потвърден.',
    'regex' => ':attribute е в неправилен формат.',
    'numeric' => 'Полето :attribute трябва да съдържа само числа.',
    'exists' => 'Избраното :attribute е невалидно.',
    'attributes' => [
        'phone' => 'телефонен номер',
        'identity' => 'личен номер',
        'email' => 'имейл',
        'name' => 'име',
        'surname' => 'фамилия',
        'gender' => 'пол',
        'identity' => 'личен номер',
        'password' => 'парола',
        'smsVerificationCode' => 'SMS код за потвърждение',
        'password_confirmation' => 'потвърждение на парола',
    ],
    'custom' => [
        'phone' => [
            'regex' => 'Моля, въведете валиден български мобилен номер, започващ с 87, 88 или 89 (например: 88XXXXXXXX).',
            'required' => 'Телефонният номер е задължителен.',
            'digits' => 'Телефонният номер трябва да съдържа само цифри.',
            'digits_between' => 'Телефонният номер трябва да е между :min и :max цифри.',
        ],
        'identity' => [
            'numeric' => 'Номерът на личната карта/ТC трябва да съдържа само цифри.',
        ],
        'pnr_code' => [
            'required' => 'PNR кодът е задължителен.',
            'min' => 'PNR кодът трябва да е поне :min символа.',
            'max' => 'PNR кодът не може да бъде повече от :max символа.',
        ],
    ],
];
